stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_hal_comp.h
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup COMP_Exported_Constants COMP Exported Constants
  * @{
  */

/** @defgroup COMP_Error_Code COMP Error Code
  * @{
  */
#define HAL_COMP_ERROR_NONE             (0x00UL)  /*!< No error */
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
#define HAL_COMP_ERROR_INVALID_CALLBACK (0x01UL)  /*!< Invalid Callback error */
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
/**
  * @}
  */


/** @defgroup COMP_WindowMode COMP Window Mode
  * @{
  */
#define COMP_WINDOWMODE_DISABLE                 (0x00000000UL)            /*!< Window mode disable: Comparators
                                                                               instances pair COMP1 and COMP2 are
                                                                               independent */
#define COMP_WINDOWMODE_COMP1_INPUT_PLUS_COMMON (COMP_CSR_WINMODE)        /*!< Window mode enable: Comparators instances
                                                                               pair COMP1 and COMP2 have their input
                                                                               plus connected together.
                                                                               The common input is COMP1 input plus
                                                                               (COMP2 input plus is no more accessible).
                                                                               */
#define COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON (COMP_CSR_WINMODE \
                                                 | COMP_WINDOWMODE_COMP2) /*!< Window mode enable: if used from COMP1 or
                                                                               COMP2 instance, comparators instances
                                                                               pair COMP1 and COMP2 have their input
                                                                               plus connected together, the common input
                                                                               is COMP2 input plus (COMP1 input plus is
                                                                               no more accessible). */
/**
  * @}
  */

/** @defgroup COMP_WindowOutput COMP Window output
  * @{
  */
#define COMP_WINDOWOUTPUT_EACH_COMP (0x00000000UL)            /*!< Window output default mode: Comparators output are
                                                                   indicating each their own state.
                                                                   To know window mode state: each comparator output
                                                                   must be read, if "((COMPx exclusive or COMPy) == 1)"
                                                                   then monitored signal is within comparators window.*/
#define COMP_WINDOWOUTPUT_COMP1     (COMP_CSR_WINOUT)         /*!< Window output synthesized on COMP1 output:
                                                                   COMP1 output is no more indicating its own state, but
                                                                   global window mode state (logical high means
                                                                   monitored signal is within comparators window).
                                                                   Note: impacts only comparator output signal level
                                                                   (COMPx_OUT propagated to GPIO, EXTI lines,
                                                                   timers, ...), does not impact output digital state
                                                                   of comparator (COMPx_VALUE) always reflecting each
                                                                   comparator output state.*/
#define COMP_WINDOWOUTPUT_COMP2     (COMP_CSR_WINOUT \
                                     | COMP_WINDOWMODE_COMP2) /*!< Window output synthesized on COMP2 output:
                                                                   COMP2 output is no more indicating its own state, but
                                                                   global window mode state (logical high means
                                                                   monitored signal is within comparators window).
                                                                   Note: impacts only comparator output signal level
                                                                   (COMPx_OUT propagated to GPIO, EXTI lines,
                                                                   timers, ...), does not impact output digital state
                                                                   of comparator (COMPx_VALUE) always reflecting each
                                                                   comparator output state.*/
#define COMP_WINDOWOUTPUT_BOTH      (0x00000001UL)            /*!< Window output synthesized on both comparators output
                                                                   of pair of comparator selected (COMP1 and COMP2:
                                                                   both comparators outputs are no more indicating their
                                                                   own state, but global window mode state (logical high
                                                                   means monitored signal is within comparators window).
                                                                   This is a specific configuration (technically
                                                                   possible but not relevant from application
                                                                   point of view:
                                                                   2 comparators output used for the same signal level),
                                                                   standard configuration for window mode is one of the
                                                                   settings above. */
/**
  * @}
  */


/** @defgroup COMP_PowerMode COMP power mode
  * @{
  */
/* Note: For the characteristics of comparator power modes                    */
/*       (propagation delay and power consumption),                           */
/*       refer to device datasheet.                                           */
#define COMP_POWERMODE_HIGHSPEED       (0x00000000UL)         /*!< High Speed */
#define COMP_POWERMODE_MEDIUMSPEED     (COMP_CSR_PWRMODE_0)   /*!< Medium Speed */
/**
  * @}
  */

/** @defgroup COMP_InputPlus COMP input plus (non-inverting input)
  * @{
  */
#define COMP_INPUT_PLUS_IO1          (0x00000000UL)           /*!< Comparator input plus connected to IO1 (pin PA2 for COMP1, pin PA0 for COMP2) */
/**
  * @}
  */

